# running in arbiter_round_robin/src/
read -formal arbiter_round_robin.v
prep -top arbiter_round_robin

hierarchy -smtcheck
rename -witness
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
